# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел.
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.

# *Пример:*

# 2 2
#     4

def recsum(A, B):
    if B == 0:
        return A
    return 1 + recsum(A, B - 1)


print(recsum(3, 2))
